---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.AirHeatingCoilType
source: html/7a900820-76ab-1f8b-920e-569340fb04a4.htm
---
# Autodesk.Revit.DB.Mechanical.AirHeatingCoilType

The type of air heating coil.

## Syntax (C#)
```csharp
public enum AirHeatingCoilType
```